Repository: aleksejs1/writer2l
Catalog: translations/validators.*.xlf
Languages: lv

source: This value should be false.
lv: Šai vērtībai ir jābūt nepatiesai.

source: This value should be true.
lv: Šai vērtībai ir jābūt patiesai.

source: This value should be of type {{ type }}.
lv: Šīs vērtības tipam ir jābūt {{ type }}.

source: This value should be blank.
lv: Šai vērtībai ir jābūt tukšai.

source: The value you selected is not a valid choice.
lv: Vērtība, kuru jūs izvēlējāties nav derīga izvēle.

source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
lv: Jums nav jāveic izvēle.|Jums ir jāveic vismaz {{ limit }} izvēle.|Jums ir jāveic vismaz {{ limit }} izvēles.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
lv: Jums nav jāveic izvēle.|Jums ir jāveic ne vairāk kā {{ limit }} izvēle.|Jums ir jāveic ne vairāk kā {{ limit }} izvēles.

source: One or more of the given values is invalid.
lv: Viena vai vairākas no dotajām vērtībām ir nederīgas.

source: This field was not expected.
lv: Šis lauks netika gaidīts.

source: This field is missing.
lv: Šis lauks ir pazudis.

source: This value is not a valid date.
lv: Šī vērtība ir nederīgs datums.

source: This value is not a valid datetime.
lv: Šī vērtība ir nederīgs datums un laiks

source: This value is not a valid email address.
lv: Šī vērtība ir nederīga e-pasta adrese.

source: The file could not be found.
lv: Fails nav atrasts.

source: The file is not readable.
lv: Fails nav lasāms.

source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
lv: Fails ir pārāk liels ({{ size }} {{ suffix }}). Atļautais maksimālais izmērs ir {{ limit }} {{ suffix }}.

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
lv: Faila mime tips nav derīgs ({{ type }}). Atļautie mime tipi ir {{ types }}.

source: This value should be {{ limit }} or less.
lv: Šai vērtībai ir jābūt ne vairāk kā {{ limit }}.

source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
lv: Šīs vērtības garums ir 0 rakstzīmju.|Šī vērtība ir pārāk gara. Tai būtu jābūt ne vairāk kā {{ limit }} rakstzīmei.|Šī vērtība ir pārāk gara. Tai būtu jābūt ne vairāk kā {{ limit }} rakstzīmēm.

source: This value should be {{ limit }} or more.
lv: Šai vērtībai ir jābūt ne mazāk kā {{ limit }}.

source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
lv: Šīs vērtības garums ir 0 rakstzīmju.|Šī vērtība ir pārāk īsa. Tai būtu jābūt ne mazāk kā {{ limit }} rakstzīmei.|Šī vērtība ir pārāk īsa. Tai būtu jābūt ne mazāk kā {{ limit }} rakstzīmēm.

source: This value should not be blank.
lv: Šai vērtībai nav jābūt tukšai.

source: This value should not be null.
lv: Šai vērtībai nav jābūt null.

source: This value should be null.
lv: Šai vērtībai ir jābūt null.

source: This value is not valid.
lv: Šī vērtība ir nederīga.

source: This value is not a valid time.
lv: Šī vērtība ir nederīgs laiks.

source: This value is not a valid URL.
lv: Šī vērtība ir nederīgs URL.

source: The two values should be equal.
lv: Abām vērtībām jābūt vienādam.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
lv: Fails ir pārāk liels. Atļautais maksimālais izmērs ir {{ limit }} {{ suffix }}.

source: The file is too large.
lv: Fails ir pārāk liels.

source: The file could not be uploaded.
lv: Failu nevarēja augšupielādēt.

source: This value should be a valid number.
lv: Šai vērtībai ir jābūt derīgam skaitlim.

source: This file is not a valid image.
lv: Šis fails nav derīgs attēls.

source: This is not a valid IP address.
lv: Šī nav derīga IP adrese.

source: This value is not a valid language.
lv: Šī vērtība nav derīga valoda.

source: This value is not a valid locale.
lv: Šī vērtība nav derīga lokalizācija.

source: This value is not a valid country.
lv: Šī vērtība nav derīga valsts.

source: This value is already used.
lv: Šī vērtība jau tiek izmantota.

source: The size of the image could not be detected.
lv: Nevar noteikt attēla izmēru.

source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
lv: Attēla platums ir pārāk liels ({{ width }}px). Atļautais maksimālais platums ir {{ max_width }}px.

source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
lv: Attēla platums ir pārāk mazs ({{ width }}px). Minimālais sagaidāmais platums ir {{ min_width }}px.

source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
lv: Attēla augstums ir pārāk liels ({{ height }}px). Atļautais maksimālais augstums ir {{ max_height }}px.

source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
lv: Attēla augstums ir pārāk mazs ({{ height }}px). Minimālais sagaidāmais augstums ir {{ min_height }}px.

source: This value should be the user's current password.
lv: Šai vērtībai ir jābūt lietotāja pašreizējai parolei.

source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
lv: Šīs vērtības garums ir 0 rakstzīmju.|Šai vērtībai ir jābūt tieši {{ limit }} rakstzīmei.|Šai vērtībai ir jābūt tieši {{ limit }} rakstzīmēm.

source: The file was only partially uploaded.
lv: Fails bija tikai daļēji augšupielādēts.

source: No file was uploaded.
lv: Fails netika augšupielādēts.

source: No temporary folder was configured in php.ini.
lv: Pagaidu mape php.ini failā nav nokonfigurēta.

source: Cannot write temporary file to disk.
lv: Nevar ierakstīt pagaidu failu uz diska.

source: A PHP extension caused the upload to fail.
lv: PHP paplašinājums izraisīja augšupielādes neizdošanos.

source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
lv: Šis krājums satur 0 elementu.|Šim krājumam jāsatur vismaz {{ limit }} elementu.|Šim krājumam jāsatur vismaz {{ limit }} elementus.

source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
lv: Šis krājums satur 0 elementu.|Šim krājumam jāsatur ne vairāk kā {{ limit }} elementu.|Šim krājumam jāsatur ne vairāk kā {{ limit }} elementus.

source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
lv: Šis krājums satur 0 elementu.|Šim krājumam jāsatur tieši {{ limit }} elementu.|Šim krājumam jāsatur tieši {{ limit }} elementus.

source: Invalid card number.
lv: Nederīgs kartes numurs.

source: Unsupported card type or invalid card number.
lv: Neatbalstīts kartes tips vai nederīgs kartes numurs.

source: This is not a valid International Bank Account Number (IBAN).
lv: Šis nav derīgs starptautisks banku konta numurs (IBAN).

source: This value is not a valid ISBN-10.
lv: Šī vērtība nav derīgs ISBN-10 numurs.

source: This value is not a valid ISBN-13.
lv: Šī vērtība nav derīgs ISBN-13 numurs

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
lv: Šī vērtība neatbilst ne derīgam ISBN-10 numuram, ne derīgm ISBN-13 numuram.

source: This value is not a valid ISSN.
lv: Šī vērtība nav derīgs ISSN numurs

source: This value is not a valid currency.
lv: Šī vērtība nav derīga valūta

source: This value should be equal to {{ compared_value }}.
lv: Šai vērtībai ir jābūt vienādai ar {{ compared_value }}.

source: This value should be greater than {{ compared_value }}.
lv: Šai vērtībai ir jābūt lielākai par {{ compared_value }}.

source: This value should be greater than or equal to {{ compared_value }}.
lv: Šai vērtībai ir jābūt lielākai vai vienādai ar {{ compared_value }}.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
lv: Šai vērtībai ir jābūt identiskai ar {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
lv: Šai vērtībai ir jābūt mazākai par {{ compared_value }}.

source: This value should be less than or equal to {{ compared_value }}.
lv: TŠai vērtībai ir jābūt mazākai vai vienādai ar {{ compared_value }}.

source: This value should not be equal to {{ compared_value }}.
lv: Šai vērtībai ir jābūt vienādai ar {{ compared_value }}.

source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
lv: Šai vērtībai nav jābūt identiskai ar {{ compared_value_type }} {{ compared_value }}.

source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
lv: Attēla attiecība ir pārāk liela ({{ ratio }}). Atļautā maksimālā attiecība ir {{ max_ratio }}.

source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
lv: Attēla attiecība ir pārāk maza ({{ ratio }}). Minimālā sagaidāmā attiecība ir {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
lv: Šis attēls ir kvadrāts ({{ width }}x{{ height }}px). Kvadrātveida attēli nav atļauti.

source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
lv: Attēls ir orientēts kā ainava ({{ width }}x{{ height }}px). Attēli, kas ir orientēti kā ainavas nav atļauti.

source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
lv: Attēls ir orientēts kā portrets ({{ width }}x{{ height }}px). Attēli, kas ir orientēti kā portreti nav atļauti.

source: An empty file is not allowed.
lv: Tukšs fails nav atļauts.

source: The host could not be resolved.
lv: Resursdatora nosaukumu nevar atrisināt.

source: This value does not match the expected {{ charset }} charset.
lv: Šī vērtība neatbilst sagaidāmajai rakstzīmju kopai {{ charset }}.

source: This is not a valid Business Identifier Code (BIC).
lv: Šī vērtība nav derīgs Biznesa Identifikācijas Kods (BIC).

source: Error
lv: Kļūda

source: This is not a valid UUID.
lv: Šis nav derīgs UUID.

source: This value should be a multiple of {{ compared_value }}.
lv: Šai vērtībai jābūt vairākas reizes atkārtotai {{ compared_value }}.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
lv: Šis Biznesa Identifikācijas Kods (BIC) neatbilst {{ iban }} konta numuram (IBAN).

source: This value should be valid JSON.
lv: Šai vērtībai jābūt derīgam JSON.

source: This collection should contain only unique elements.
lv: Šai kolekcijai jāsatur tikai derīgi elementi.

source: This value should be positive.
lv: Šai vērtībāi jābūt pozitīvai.

source: This value should be either positive or zero.
lv: Šai vērtībāi jābūt pozitīvai vai vienādai ar nulli.

source: This value should be negative.
lv: Šai vērtībāi jābūt negatīvai.

source: This value should be either negative or zero.
lv: Šai vērtībāi jābūt negatīvai vai vienādai ar nulli.

source: This value is not a valid timezone.
lv: Šī vērtība nav derīga laika zona.

source: This password has been leaked in a data breach, it must not be used. Please use another password.
lv: Šī parole tika publicēta datu noplūdē, viņu nedrīkst izmantot. Lūdzu, izvēlieties citu paroli.

source: This value should be between {{ min }} and {{ max }}.
lv: Šai vērtībai jābūt starp {{ min }} un {{ max }}.

source: This value is not a valid hostname.
lv: Šī vērtība nav derīgs tīmekļa servera nosaukums.

source: The number of elements in this collection should be a multiple of {{ compared_value }}.
lv: Elementu skaitam šajā kolekcijā jābūt {{ compared_value }} reizinājumam.

source: This value should satisfy at least one of the following constraints:
lv: Šai vērtībai jāiekļaujas vismaz vienā no sekojošiem ierobežojumiem:

source: Each element of this collection should satisfy its own set of constraints.
lv: Šīs kolekcijas katram elementam jāiekļaujas savā ierobežojumu kopā.

source: This value is not a valid International Securities Identification Number (ISIN).
lv: Šī vērtība nav derīgs starptautiskais vērtspapīru identifikācijas numurs (ISIN).

source: This form should not contain extra fields.
lv: Šajā veidlapā nevajadzētu būt papildus ievades laukiem.

source: The uploaded file was too large. Please try to upload a smaller file.
lv: Augšupielādētā faila izmērs bija par lielu. Lūdzu mēģiniet augšupielādēt mazāka izmēra failu.

source: The CSRF token is invalid. Please try to resubmit the form.
lv: Dotais CSRF talons nav derīgs. Lūdzu mēģiniet vēlreiz iesniegt veidlapu.

source: This value is not a valid HTML5 color.
lv: Šī vertība nav derīga HTML5 krāsa.

source: Please enter a valid birthdate.
lv: Lūdzu, ievadiet derīgu dzimšanas datumu.

source: The selected choice is invalid.
lv: Iezīmētā izvēle nav derīga.

source: The collection is invalid.
lv: Kolekcija nav derīga.

source: Please select a valid color.
lv: Lūdzu, izvēlieties derīgu krāsu.

source: Please select a valid country.
lv: Lūdzu, izvēlieties derīgu valsti.

source: Please select a valid currency.
lv: Lūdzu, izvēlieties derīgu valūtu.

source: Please choose a valid date interval.
lv: Lūdzu, izvēlieties derīgu datumu intervālu.

source: Please enter a valid date and time.
lv: Lūdzu, ievadiet derīgu datumu un laiku.

source: Please enter a valid date.
lv: Lūdzu, ievadiet derīgu datumu.

source: Please select a valid file.
lv: Lūdzu, izvēlieties derīgu failu.

source: The hidden field is invalid.
lv: Slēptā lauka vērtība ir nederīga.

source: Please enter an integer.
lv: Lūdzu, ievadiet veselu skaitli.

source: Please select a valid language.
lv: Lūdzu, izvēlieties derīgu valodu.

source: Please select a valid locale.
lv: Lūdzu, izvēlieties derīgu lokalizāciju.

source: Please enter a valid money amount.
lv: Lūdzu, ievadiet derīgu naudas lielumu.

source: Please enter a number.
lv: Lūdzu, ievadiet skaitli.

source: The password is invalid.
lv: Parole ir nederīga.

source: Please enter a percentage value.
lv: Lūdzu, ievadiet procentuālo lielumu.

source: The values do not match.
lv: Vērtības nesakrīt.

source: Please enter a valid time.
lv: Lūdzu, ievadiet derīgu laiku.

source: Please select a valid timezone.
lv: Lūdzu, izvēlieties derīgu laika zonu.

source: Please enter a valid URL.
lv: Lūdzu, ievadiet derīgu URL.

source: Please enter a valid search term.
lv: Lūdzu, ievadiet derīgu meklēšanas nosacījumu.

source: Please provide a valid phone number.
lv: Lūdzu, ievadiet derīgu tālruņa numuru.

source: The checkbox has an invalid value.
lv: Izvēles rūtiņai ir nederīga vērtība.

source: Please enter a valid email address.
lv: Lūdzu, ievadiet derīgu e-pasta adresi.

source: Please select a valid option.
lv: Lūdzu, izvēlieties derīgu opciju.

source: Please select a valid range.
lv: Lūdzu, izvēlieties derīgu diapazonu.

source: Please enter a valid week.
lv: Lūdzu, ievadiet derīgu nedeļu.
